Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་པ་དེ་བཞིན་ཏུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་དང་། མྱི་ཆེན་པོའི་མཚན་རེ་རེ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་ནས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་། ཕན་ཚུན་མ་འདྲེས་པར་མཐོང་བར་གྱུར་ཏོ།
en: Just as he saw the past and future of this world realm, in that way he saw the succession of all world realms. In the same way, he saw the past and future successive world realms of all world realms in the ten directions in the bodhisattva Samanta­bhadra’s body, and in each of his physical signs of a great being and in each pore, all distinctly and not mixed with one another.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ཡང་ཇི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྤྱན་སྔ་ན་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོའི་སྙིང་པོ་ཅན་ལ་འདུག་ཅིང་རྣམ་པར་རྩེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་སྟོན་པར་མཐོང་བ་དེ་བཞིན་དུ་ཤར་ཕྱོགས་ནའང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཟང་པོའི་དཔལ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་པད་མོའི་དཔལ་ན་རྣམ་པར་རྩེ་བ་འདི་ཉིད་ཡོངས་སུ་སྟོན་ཅིང་འདུག་པར་མཐོང་ངོ་།
en: In the same way that he saw the bodhisattva Samanta­bhadra manifesting this play of being seated on a great precious lotus on the center of a lion throne in front of the Bhagavat, the Tathāgata Vairocana, in the same way he saw him manifesting this same play in the eastern direction in the world realm Padmaśrī of the Bhagavat, the Tathāgata Bhadra­śrī

source: །ཤར་ཕྱོགས་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཀུན་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོའི་སྙིང་པོ་ཅན་ལ་འདུག་ཅིང་རྣམ་པར་རྩེ་བ་འདི་ཉིད་ཡོངས་སུ་སྟོན་པ་མཐོང་ངོ་།
en: In the same way as in the eastern direction, he saw the bodhisattva Samanta­bhadra manifesting this play of being seated on a great precious lotus on the center of a lion throne in front of all the tathāgatas of all the world realms in the principal and intermediate directions.

source: །ཇི་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོའི་སྙིང་པོ་ཅན་ལ་འདུག་ཅིང་རྣམ་པར་རྩེ་བ་འདི་ཉིད་ཡོངས་སུ་སྟོན་པར་མཐོང་བ་དེ་བཞིན་དུ། ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དག་ལ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེའི་སངས་རྒྱས་ཀྱི་འཁོར་ཆོས་ཀྱི་དབྱིངས་ལྟར་རྒྱ་ཆེ་བ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོའི་སྙིང་པོ་ཅན་ལ་འདུག་ཅིང་རྣམ་པར་རྩེ་བ་འདི་ཉིད་ཡོངས་སུ་སྟོན་པ་མཐོང་ངོ་།
en: In the same way that he saw the bodhisattva Samanta­bhadra manifesting this display of being seated on a great precious lotus on the center of a lion throne in front of all the tathāgatas in all the world realms in the ten directions, he saw, in the atoms of all the buddha realms in the ten directions, the bodhisattva Samanta­bhadra manifesting this display of being seated on a great precious lotus upon the center of a lion throne in front of all the tathāgatas within an assembly of followers of the Buddha, as vast as the realm of phenomena, in each atom.

source: །དེའི་ལུས་རེ་རེ་ལས་ཀྱང་དུས་གསུམ་དུ་བྱུང་བའི་དམིགས་པ་ཐམས་ཅད་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་རྣམ་པར་དམིགས་པར་མངོན་པར་བསྟན་པ་མཐོང་ངོ་།
en: He saw in each of those bodies the manifestation of reflections of all objects of perception in the three times.

source: །ཞིང་ཐམས་ཅད་དང་སེམས་ཅན་ཐམས་ཅད་དང་སངས་རྒྱས་བྱུང་བ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱང་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་རྣམ་པར་དམིགས་པར་མངོན་ཏུ་བསྟན་པ་མཐོང་ངོ་།
en: He saw the manifestation of the perceptions as reflections of all realms, all beings, all appearances of buddhas, and all the assemblies of bodhisattva followers.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དབྱངས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དང་གདམས་ངག་ཡོངས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྡུ་བ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་རོལ་པ་དག་ཀྱང་ཐོས་པར་གྱུར་ཏོ།
en: He heard the sounds of all beings, the voices of all buddhas, the Dharma wheels of all tathāgatas, and all the miraculous manifestations of the teaching of instructions.

source: །དེས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་རྣམ་པར་རྩེ་བ་དེ་ལྟ་བུ་དག་མཐོང་སྟེ། ཐོས་ནས་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་བཅུ་ཐོབ་པར་གྱུར་ཏོ།
en: Having seen and heard in that way the play of the bodhisattva Samanta­bhadra’s liberation, he attained the ten practices of the perfection of knowledge.

source: །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those ten?

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ལུས་ཀྱིས་རྒྱས་པར་དགང་བའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: He attained the practice of the perfection of knowledge of filling all buddha realms with his body in each instant of mind;

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་འགྲོ་བ་ལ་ཐ་མི་དད་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge of going into the presence of all tathāgatas without differentiation;

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་ཅིང་རིམ་གྲོ་བྱ་བའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge of serving and making offerings to all tathāgatas;

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཞུས་པ་རབ་ཏུ་བླང་བའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge of the attainment of acquiring all the Dharmas of the buddhas from all tathāgatas and from each tathāgata;

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ངེས་པར་རྟོགས་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge of the definitive understanding of the Dharma wheels of all tathāgatas; (6) he attained the practice of the perfection of knowledge of the inconceivable miracles of the buddhas;

source: །སོ་སོ་ཡང་དག་པར་རིག་པ་ཟད་མི་ཤེས་པའི་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་བྱིན་གྱིས་བརླབས་ཏེ། ཆོས་ཀྱི་ཚིག་གཅིག་ཤིན་ཏུ་བསྟན་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ། །ཆོས་ཀྱི་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་སུམ་དུ་རབ་ཏུ་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge of an unceasing discernment of all Dharmas, which is steadfast until the last of future kalpas, through the teaching of a single word of the Dharma;

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge that directly perceives the entire ocean of the Dharma;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཡོངས་སུ་སྒྲུབ་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: he attained the practice of the perfection of knowledge that manifests within the perceptions of all beings;

source: །སྐད་ཅིག་གཅིག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་མངོན་སུམ་དུ་རབ་ཏུ་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: and (10) he attained the practice of the perfection of knowledge that directly perceives the conduct of the bodhisattva Samanta­bhadra in each instant of mind.

source: །དེ་ལྟར་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་དང་ལྡན་པའི་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ་བཞག་པར་གྱུར་ཏོ།
en: The bodhisattva Samanta­bhadra extended his right hand and placed it upon the head of Sudhana, the head merchant’s son, who possessed such a practice of the perfection of knowledge.

source: །དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་ལག་པ་བཞག་མ་ཐག་ཏུ་དེའི་མོད་ལ་དེས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་ཞུགས་པར་གྱུར་ཏེ།
en: The instant that the bodhisattva Samanta­bhadra placed his right hand upon the head of Sudhana, the head merchant’s son, he entered as many samādhi gateways as there are atoms in all buddha realms.

source: ཏིང་ངེ་འཛིན་རེ་རེ་ལས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྔོན་ཆད་མ་མཐོང་བདག་ལའང་ཞུགས་པར་གྱུར་ཏོ།
en: In each samādhi he realized the sight of an ocean of world realms, as numerous as the atoms in a buddha realm, which he had never seen before.

source: །དེའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་ཚོགས་སུ་གྱུར་ཏོ།
en: He gathered as many accumulations of omniscience as there are atoms in a buddha realm.

source: །དེའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཀྱི་ཚོགས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་རབ་ཏུ་བྱུང་བར་གྱུར་ཏོ།
en: There came as many accumulations of the Dharmas of omniscience as there are atoms in a buddha realm.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་གནས་པར་བྱ་བ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་མངོན་པར་འཕགས་པར་གྱུར་ཏོ།
en: He arose to as many great establishments in omniscience as there are atoms in a buddha realm.

source: །སྨོན་ལམ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལའང་ཞུགས་པར་གྱུར་ཏོ།
en: He comprehended an ocean of prayers as numerous as the atoms in a buddha realm.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བའི་ལམ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀྱང་བྱུང་བར་གྱུར་ཏོ།
en: He set out along paths that have arisen from omniscience, which were as numerous as the atoms in a buddha realm.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལའང་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ།
en: He entered into as many bodhisattva conducts as there are atoms in a buddha realm.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དྲག་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀྱང་རྣམ་པར་འཕེལ་བར་གྱུར་ཏོ།
en: He increased as many powers of omniscience as there are atoms in a buddha realm.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་སྣང་བ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀྱང་རབ་ཏུ་སྣང་བར་གྱུར་ཏོ།
en: He illuminated with as many illuminations from the knowledge of all buddhas as there are atoms in a buddha realm.

source: །ཇི་ལྟར་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྤྱན་སྔ་ན་འདུག་པས་ལག་པ་གཡས་པ་བརྐྱང་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོར་བཞག་པ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་ཀྱང་ལག་པ་གཡས་པ་བརྐྱང་ཞིང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོ་ལ་བཞག་པར་གྱུར་ཏོ།
en: Just as the bodhisattva Samanta­bhadra, at the feet of the Bhagavat, the Tathāgata Vairocana in this Sahā world realm, extended his right hand and placed it upon the head of Sudhana, the head merchant’s son, in the same way, the bodhisattva Samanta­bhadra at the feet of the tathāgatas in all world realms extended his right hand and placed it upon the head of Sudhana, the head merchant’s son.

source: །དེ་བཞིན་དུ་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དག་གི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་ཀྱང་ལག་པ་གཡས་པ་བརྐྱང་ཞིང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོ་ལ་བཞག་པར་གྱུར་ཏོ།
en: In the same way, the bodhisattva Samanta­bhadra at the feet of all the tathāgatas within the atoms of all world realms in all the principal and intermediate directions extended his right hand and placed it upon the head of Sudhana, the head merchant’s son.

source: །ཇི་ལྟར་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལག་པས་རེག་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཆོས་ཀྱི་སྒོ་མང་པོ་ལ་ཞུགས་པར་གྱུར་པ་དེ་བཞིན་དུ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ཐམས་ཅད་ལས་འཕྲོས་པའི་ལག་པའི་སྤྲིན་མང་པོས་རེག་པའི་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཀྱང་ཆོས་ཀྱི་སྒོ་མང་པོ་ལ་ཚུལ་སྣ་ཚོགས་ཀྱིས་ཞུགས་པར་གྱུར་ཏོ།
en: Just as Sudhana, the head merchant’s son, entered many Dharma gateways when touched by the hand of the bodhisattva Samanta­bhadra at the feet of the Bhagavat Vairocana, in the same way Sudhana, the head merchant’s son, entered in many ways many Dharma gateways when touched by the clouds of hands emanated from all the bodies of Samanta­bhadra.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ངའི་རྣམ་པར་འཕྲུལ་པ་མཐོང་མོད།
en: Then the bodhisattva mahāsattva Samanta­bhadra said to Sudhana, the head merchant’s son, “Noble one, you have seen my miraculous manifestations.”

source: སྨྲས་པ་འཕགས་པ་མཐོང་ནི་མཐོང་ན་དེ་ཙམ་དུ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་ཐར་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ན་མཁྱེན་གྲང་ངོ་།
en: Sudhana said, “Ārya, I have seen them. The inconceivable liberations that I have seen can only be known by the knowledge of a tathāgata.”

source: །དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ངས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མངོན་པར་འདོད་ཅིང་། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་རྣམ་པར་སྤྱད་དེ།
en: Samanta­bhadra said, “Noble one, I long for the omniscient mind and have practiced for as many kalpas as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: བསྐལ་པ་ཆེན་པོ་དེ་དག་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་སྦྱོང་བར་བྱེད་ཅིང་། ངས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །བསྐལ་པ་ཆེན་པོ་དེ་དག་རེ་རེ་ལ་ཡང་།
en: “In each of those great kalpas, I purified the aspiration for enlightenment, and I served as many tathāgatas as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བསོད་ནམས་ཡོངས་སུ་སྡུད་པ་བྱེད་ཅིང་། མཆོད་སྦྱིན་ཆེན་པོ་གཏང་བ་ཐམས་ཅད་དང་སྦྱར་བ།
en: “In each of those great kalpas, I accumulated the merit for omniscience and engaged in all the great giving of gifts and offerings.

source: འཇིག་རྟེན་ཐམས་ཅད་དུ་རྣམ་པར་གྲགས་པ། སེམས་ཅན་ཐམས་ཅད་ལ་བསྟབས་པ་དག་ཀྱང་མཆོད་སྦྱིན་ཏུ་བྱས་སོ།
en: I held bestowals of gifts and offerings that were proclaimed throughout the world and were bestowed upon all beings.

source: །བསྐལ་པ་ཆེན་པོ་དེ་དག་རེ་རེ་ལ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ལ་མངོན་པར་སྨོན་ཅིང་གཏང་བ་དང་། གཏང་བ་ཆེན་པོ་དང་། ཤིན་ཏུ་གཏང་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བྱས་སོ།
en: “In each of those great kalpas, aspiring to the Dharmas of omniscience, I gave gifts, great gifts, and extreme gifts that were as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །བསྐལ་པ་ཆེན་པོ་དེ་དག་རེ་རེ་ལ་ཡང་ལུས་དང་སྲོག་ཕངས་པར་བྱ་བ་མྱེད་པར་སངས་རྒྱས་ཀྱི་ཆོས་གཅེས་པར་བྱ་བས་ལུས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ཞིག་ཡོངས་སུ་བཏང་ངོ་རྒྱལ་པོའི་སྲིད་ཆེན་པོ་ཡང་ཡོངས་སུ་བཏང་ངོ་།
en: “In each of those great kalpas, without concern for body and life, and cherishing the Dharma of the buddhas, I gave away bodies as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །གྲོང་དང་གྲོང་ཁྱེར་དང་ལྗོངས་དང་ཡུལ་དང་ཁམས་དང་རྒྱལ་པོའི་གནས་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away great kingdoms. I gave away villages, towns, regions, lands, realms, and royal capitals.

source: །སྡུག་ཅིང་ཡིད་དུ་འོང་ལ་བཏང་མི་བྲ་བའི་འཁོར་གྱི་ཚོགས་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away gatherings of entourages that were beautiful and pleasing and that I could not part with.

source: །བུ་དང་བུ་མོ་དང་ཆུང་མ་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away sons, daughters, and wives.

source: །རང་གི་ལུས་དང་། ཤ་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away my body and flesh.

source: །བདག་གི་ལུས་ལས་ཁྲག་དག་ཀྱང་སློང་བ་རྣམས་ལ་ཡོངས་སུ་བཏང་ངོ་།
en: I gave the blood from my body to those who asked for it.

source: །རུས་པ་དང་རྐང་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away my bones and marrow.

source: །རྐང་པ་དང་ལག་པ་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away my legs and arms.

source: །ཡན་ལག་དང་ཉིང་ལག་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away the greater and smaller parts of my body.

source: །སྣ་དང་རྣ་བ་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away my nose and ears.

source: །མྱིག་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away my eyes.

source: །རང་གི་ཁ་ནས་ལྕེའི་དབང་པོ་དག་ཀྱང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away the organ of my tongue from my mouth.

source: །བསྐལ་པ་ཆེན་པོ་དེ་དག་རེ་རེ་ལ་ཡང་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་བླ་ན་མེད་པར་གྱུར་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དབུ་ལ་མངོན་པར་སྨོན་ཅིང་། རང་གི་མགོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཡོངས་སུ་བཏང་ངོ་།
en: “In each of those great kalpas, aspiring for the head of omniscience that is above and higher than all worlds, I gave away my own head as many times as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །བསྐལ་པ་ཆེན་པོ་རེ་རེ་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བསྐལ་པ་ཆེན་པོ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལས་བསྐལ་པ་རྒྱ་མཚོ་རེ་རེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ལ་དབང་པོ་དམ་པར་གྱུར་ཏེ། རིམ་གྲོ་བྱས་སོ། །བཀུར་སྟི་བྱས་སོ། །ཕུད་དུད་བྱས་སོ། མཆོད་པ་བྱས་སོ། །ན་བཟའ་དང་། བཤོས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་དག་ཀྱང་དབུལ་བ་བྱས་སོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བསྟན་པ་ལ་ཡང་རབ་ཏུ་བྱུང་སྟེ།
en: “As it was in each of those great kalpas, it was the same in each of an ocean of kalpas as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms, in which through becoming a supreme lord I served, honored, and venerated tathāgatas as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms, making offerings to them and giving them clothing, food, beds, medicines when ill, and necessary utensils.

source: སངས་རྒྱས་ཀྱི་གདམས་ངག་ཐམས་ཅད་ལ་ཡང་རབ་ཏུ་ཞུགས་སོ། །དེ་དག་གི་བསྟན་པ་ཡང་། ཡོངས་སུ་གཟུང་སྟེ།
en: I entered homelessness in the teachings of those tathāgatas, following all their instructions, and held their teachings.

source: རིགས་ཀྱི་བུ་དེ་སྙེད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོར་ཡང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་སེམས་བསྐྱེད་པ་འགའ་ཙམ་གྱིས་ཀྱང་། མི་མཐུན་པའི་སེམས་བསྐྱེད་དུ་མི་དྲན་ནོ།
en: “Noble one, throughout the ocean of that many kalpas, I developed an aspiration solely for the teaching of the tathāgatas and do not remember ever developing an inappropriate aspiration.

source: །དེ་སྙེད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོར་སེམས་བསྐྱེད་པ་འགའ་ཙམ་གྱིས་ཀྱང་ཁོང་ཁྲོ་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པའམ། བདག་ཏུ་འཛིན་པའི་སེམས་སམ། བདག་ཡོངས་སུ་བསྐྱང་ཞིང་ཡོངས་སུ་གཟུང་བའི་སེམས་སམ། བདག་དང་གཞན་ཏུ་དབྱེ་བའི་སེམས་སམ། བྱང་ཆུབ་ཀྱི་ལམ་དང་བྲལ་བར་བྱ་བའི་སེམས་སམ། འཁོར་བ་ན་གནས་པས་ཡོངས་སུ་སྐྱོ་བའི་སེམས་སམ། ཞུམ་པའི་སེམས་སམ། སྒྲིབ་པས་མགོ་རྨོངས་པའི་སེམས་བསྐྱེད་དུ་མི་དྲན་ཏེ།
en: Throughout the ocean of that many kalpas, I developed solely that aspiration, and I do not remember developing an aspiration through anger, an aspiration through fixation on the self, an aspiration from protecting and grasping a self, an aspiration that made a distinction between self and others, or an aspiration that was not connected with the path to enlightenment, nor do I remember developing an aspiration that became wearied or disheartened or confused by obscurations through remaining in saṃsāra.

source: གཞན་དུ་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་བསྩགས་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་ཡེ་ཤེས་གཞན་གྱིས་མི་ཐུབ་ཅིང་བརྒལ་བར་དཀའ་བའི་སྙིང་པོ་དང་ལྡན་པ་བསྐྱེད་དོ།
en: Instead, I developed the aspiration for gathering the accumulations for omniscience, an aspiration that had an invincible knowledge and unconquerable essence.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: “Noble one, it is like this:

source: ངའི་སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་པའི་སྦྱོར་བ་དག་དང་། དེས་སྙིང་རྗེ་ཆེན་པོའི་སེམས་རབ་ཏུ་ཐོབ་སྟེ། སེམས་ཅན་ཡོངས་སུ་བསྐྱབས་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཡོངས་སུ་སྦྱང་བར་བྱས་པའི་སྦྱོར་བ་དག་དང་། སངས་རྒྱས་མཆོད་ཅིང་བསྙེན་བཀུར་བའི་སྦྱོར་བ་དག་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བཙལ་བའི་དོན་དུ་བླ་མ་ལ་རིམ་གྲོར་བྱས་པའི་སྦྱོར་བ་དག་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བའི་དོན་དུ་ལུས་ཡོངས་སུ་བཏང་བའི་སྦྱོར་བ་དག་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བའི་དོན་དུ་རང་གི་སྲོག་ཡོངས་སུ་བཏང་བའི་སྦྱོར་བ་དེ་དག་ནི་བསྟན་པར་བྱ་ན། བསྐལ་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་ཟད་པར་འགྱུར་རོ།
en: an ocean of kalpas would pass if I were to teach my past perfect practices, my engagement in purifying buddha realms, my engagement in protecting, ripening, and purifying beings with my attainment of great compassion, my engagement in making offerings to and serving buddhas, my engagement in serving gurus in order to seek the good Dharma, my engagement in giving away my body in order to obtain the good Dharma, and my engagement in giving up my life in order to protect the good Dharma.

source: །རིགས་ཀྱི་བུ་ངས་ནི། ཆོས་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་ལས་ཀྱང་། ཚིག་དང་ཡི་གེ་འགའ་ཙམ་ཡང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་བརྩོན་པ་དང་། རང་གི་སེམས་ཀྱི་རྒྱུད་ངེས་པར་ཤེས་པར་བྱ་བ་ལ་བརྩོན་པ་དང་། ཕ་རོལ་གྱིས་ཆོས་མངོན་དུ་ཐོས་པར་བྱ་བ་ལ་བརྩོན་པ་དང་། འཇིག་རྟེན་པའི་ཡེ་ཤེས་སྣང་བ་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པ་ལ་བརྩོན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པ་ལ་བརྩོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་བདེ་བ་ཡོངས་སུ་བསྐྱེད་པ་ལ་བརྩོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བསྔགས་པ་ལ་བརྩོན་པས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཡོངས་སུ་བཏང་བས་མ་ཉོས་པའམ། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་མོས་པ་གང་ཡང་མེད་དེ།
en: “Noble one, there is not one word or letter from all that ocean of the Dharma for which I did not give up the kingdom of a cakravartin or all my possessions through being dedicated to saving all beings, dedicated to attaining definitive understanding of the continuum of my mind, dedicated to others hearing the Dharma, dedicated to the elucidation of the light of worldly knowledge, dedicated to the elucidation of all world-transcending knowledge, dedicated to giving rise to happiness in saṃsāra for all beings, and dedicated to praising the qualities of all the tathāgatas.

source: དེ་ལྟར་ང་ཉིད་ཀྱི་སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་བསྟན་པར་བྱ་ན། བསྐལ་བ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཟད་པར་འགྱུར་རོ།
en: In that way, an ocean of kalpas as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms would pass by if I were to teach my perfect practices in the past.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་རྣམ་པ་དེ་ལྟ་བུའི་ཚོགས་ཀྱི་སྟོབས་དང་། དགེ་བའི་རྩ་བའི་རྒྱུ་བསྩགས་པའི་སྟོབས་དང་། མོས་པ་རྒྱ་ཆེན་པོའི་སྟོབས་དང་། ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་སྟོབས་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་མིག་གི་སྟོབས་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་དང་། སྨོན་ལམ་ཆེན་པོའི་སྟོབས་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་དང་། ཤིན་ཏུ་སྦྱངས་པའི་མངོན་པར་ཤེས་པའི་སྟོབས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་སྟོབས་ཀྱིས་ཆོས་ཀྱི་ལུས་ཡོངས་སུ་དག་པ་དུས་གསུམ་དུ་ཐ་མི་དད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: “Noble one, in that way, I attained the pure Dharma body that is undifferentiated by the three times through the strength of such accumulations, through the strength of the accumulation of the causal roots of merit, through the strength of a vast aspiration, through the strength of practicing the qualities, through the strength of correctly comprehending all Dharmas, through the strength of the eyes of wisdom, through the strength of the blessing of the tathāgatas, through the strength of great prayers, through the strength of great compassion, through the strength of perfectly purified higher cognitions, and through the strength of being taken into the care of the kalyāṇamitras.
